# Data Exploration

In [2]:
from nhs111_triage import config
import pandas as pd
import matplotlib as plt
import seaborn as sb

First I want to explore the NHS Excel workbook, so I get a better understanding of the data I am working with via pandas beyond just looking at the data visually via Excel.

In [4]:
workbook = pd.ExcelFile(config.nhs111_iuc_data)
for ix, sheet in enumerate(workbook.sheet_names):
    print(f'Sheet {ix}: {sheet}')

Sheet 0: Introduction
Sheet 1: Key Facts from Apr23
Sheet 2: England Key Facts Apr21-Mar23
Sheet 3: Month
Sheet 4: Geography
Sheet 5: KPI Details
Sheet 6: England Geography Apr21-Mar23
Sheet 7: KPIs Date from Apr23
Sheet 8: KPIs Geography from Apr23
Sheet 9: KPIs Geography Apr21-Mar23
Sheet 10: Key Metrics Chart
Sheet 11: Reporting Contract Areas
Sheet 12: CCG mapping to end June 2022
Sheet 13: Current ICB mapping
Sheet 14: Raw
Sheet 15: Refs

Visually inspecting the Excel Workbook, there were too hidden workbooks which now I can see here when listing the workbooks.<br>
I'm more curious to figure out the data stored in Sheet 14 and 15.

In [6]:
raw_sheet = pd.read_excel(config.nhs111_iuc_data, sheet_name= 'Raw')
ref_sheet = pd.read_excel(config.nhs111_iuc_data, sheet_name = 'Refs')

In [12]:
raw_sheet.head(2)

,Date_deriv,REPORTING_PERIOD,ORG_CODE,ORG_NAME,CONTRACT_CODE,CONTRACT_NAME,ITEM_NUMBER,VALUE,Region Code,Region Name,VALUE_for_KPI,Raw data derived
0,2023-04-01,IUCADC-MONTHLY-APR-2023,NKB,LONDON CENTRAL AND WEST UNSCHEDULED CARE COLLA...,111AD5,North Central London,A01,35693,Y56,London,35693,Date period derived from raw data
1,2023-04-01,IUCADC-MONTHLY-APR-2023,NKB,LONDON CENTRAL AND WEST UNSCHEDULED CARE COLLA...,111AD5,North Central London,A02,0,Y56,London,NaN,Geography code/name derived from ref/contract ...

In [11]:
ref_sheet.head(2)

,Validation 1,Unnamed: 1,Code/Name concat,Unnamed: 3,Unnamed: 4,Validation 2 (23/24),Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 11,Data Date,Publ Date,Unnamed: 14,Code,Area name,RegionCode,Region,ProviderCode,Supplier
0,*,England,England,National,NaN,A01,Number of calls received,NaN,NaN,NaN,...,NaN,2023-04-01,2023-06-08,NaN,111AA1,North East,Y63,North East and Yorkshire,RX6,NEAS
1,NaN,-----------,-----------,NaN,NaN,A02,Calls routed through IVR,NaN,NaN,NaN,...,NaN,2023-05-01,2023-07-13,NaN,111AI7,Yorkshire and Humber (NECS),Y63,North East and Yorkshire,0AR,NECS

In [13]:
print(f'Raw Sheet Shape: {raw_sheet.shape}')
print(f'Ref Sheet Shape: {ref_sheet.shape}')

Raw Sheet Shape: (94536, 12)
Ref Sheet Shape: (121, 21)

## Exploring Raw Sheet

In [34]:
non_null = raw_sheet.notna().sum()
dtypes = raw_sheet.dtypes
raw_summary = pd.DataFrame({
    'Column': raw_sheet.columns,
    'Non-Null Count': non_null.values,
    'Dtype': dtypes.values,
    'Null Percentage': (raw_sheet.isna().mean() * 100).round(2)
})
raw_summary

,Column,Non-Null Count,Dtype,Null Percentage
Date_deriv,Date_deriv,94536,datetime64[us],0.00
REPORTING_PERIOD,REPORTING_PERIOD,94536,str,0.00
ORG_CODE,ORG_CODE,94536,str,0.00
ORG_NAME,ORG_NAME,65988,str,30.20
CONTRACT_CODE,CONTRACT_CODE,94536,str,0.00
CONTRACT_NAME,CONTRACT_NAME,94536,str,0.00
ITEM_NUMBER,ITEM_NUMBER,94536,str,0.00
VALUE,VALUE,94536,object,0.00
Region Code,Region Code,94536,str,0.00
Region Name,Region Name,94536,str,0.00
VALUE_for_KPI,VALUE_for_KPI,83422,object,11.76
Raw data derived,Raw data derived,2,str,100.00

## Exploring Ref Sheet

In [35]:
non_null = ref_sheet.notna().sum()
dtypes = ref_sheet.dtypes
ref_summary = pd.DataFrame({
    'Column': ref_sheet.columns,
    'Non-Null Count': non_null.values,
    'Dtype': dtypes.values,
    'Null Percentage': (ref_sheet.isna().mean() * 100).round(2)
})
ref_summary

,Column,Non-Null Count,Dtype,Null Percentage
Validation 1,Validation 1,51,str,57.85
Unnamed: 1,Unnamed: 1,53,str,56.20
Code/Name concat,Code/Name concat,53,str,56.20
Unnamed: 3,Unnamed: 3,51,str,57.85
Unnamed: 4,Unnamed: 4,0,float64,100.00
Validation 2 (23/24),Validation 2 (23/24),121,str,0.00
Unnamed: 6,Unnamed: 6,121,str,0.00
Unnamed: 7,Unnamed: 7,0,float64,100.00
Unnamed: 8,Unnamed: 8,0,float64,100.00
Unnamed: 9,Unnamed: 9,0,float64,100.00
Validation 3,Validation 3,36,datetime64[us],70.25
Unnamed: 11,Unnamed: 11,0,float64,100.00
Data Date,Data Date,31,datetime64[us],74.38
Publ Date,Publ Date,31,datetime64[us],74.38
Unnamed: 14,Unnamed: 14,0,float64,100.00
Code,Code,72,str,40.50
Area name,Area name,72,str,40.50
RegionCode,RegionCode,42,str,65.29
Region,Region,42,str,65.29
ProviderCode,ProviderCode,42,str,65.29
Supplier,Supplier,42,str,65.29

I haven't had a chance to look at the data on the hidden tables on Excel, but this threw me off, I realised that most of the data above is not well structured, causing issues when parsing it with pandas.

## Other Sheets

In [37]:
other_sheets = {
    "kpi_sheet": pd.read_excel(config.nhs111_iuc_data, sheet_name= "KPI Details"),
    "contract_areas_sheet": pd.read_excel(config.nhs111_iuc_data, sheet_name= "Reporting Contract Areas"),
    "icb_mapping_sheet": pd.read_excel(config.nhs111_iuc_data, sheet_name= "Current ICB mapping"),
    "geography_sheet": pd.read_excel(config.nhs111_iuc_data, sheet_name= "Geography")
    }

def summaries():
    all_summaries = {}
    for sheet_name, table in other_sheets.items():
        non_null = table.notna().sum()
        dtypes = table.dtypes
        summary = pd.DataFrame({
            'Column': table.columns,
            'Non-Null Count': non_null.values,
            'Dtype': dtypes.values,
            'Null Percentage': (table.isna().mean() * 100).round(2)
        })
        all_summaries[sheet_name] = summary
    return all_summaries
    
results = summaries()
for name, df in results.items():
    print(f'{name}')
    print(df)

kpi_sheet
                  Column  Non-Null Count    Dtype  Null Percentage
Unnamed: 0    Unnamed: 0               1      str            99.49
Unnamed: 1    Unnamed: 1             116   object            41.41
Unnamed: 2    Unnamed: 2             117      str            40.91
Unnamed: 3    Unnamed: 3              45      str            77.27
Unnamed: 4    Unnamed: 4              44      str            77.78
Unnamed: 5    Unnamed: 5              28      str            85.86
Unnamed: 6    Unnamed: 6               0  float64           100.00
Unnamed: 7    Unnamed: 7               0  float64           100.00
Unnamed: 8    Unnamed: 8               0  float64           100.00
Unnamed: 9    Unnamed: 9             148   object            25.25
Unnamed: 10  Unnamed: 10             149      str            24.75
Unnamed: 11  Unnamed: 11              57      str            71.21
Unnamed: 12  Unnamed: 12              56      str            71.72
Unnamed: 13  Unnamed: 13              36      str            81.82
Unnamed: 14  Unnamed: 14               0  float64           100.00
Unnamed: 15  Unnamed: 15               0  float64           100.00
Unnamed: 16  Unnamed: 16               0  float64           100.00
Unnamed: 17  Unnamed: 17             141   object            28.79
Unnamed: 18  Unnamed: 18             144      str            27.27
Unnamed: 19  Unnamed: 19              56      str            71.72
Unnamed: 20  Unnamed: 20              54      str            72.73
Unnamed: 21  Unnamed: 21              34      str            82.83
contract_areas_sheet
                Column  Non-Null Count Dtype  Null Percentage
Unnamed: 0  Unnamed: 0              44   str             2.22
Unnamed: 1  Unnamed: 1              43   str             4.44
Unnamed: 2  Unnamed: 2              43   str             4.44
Unnamed: 3  Unnamed: 3              43   str             4.44
Unnamed: 4  Unnamed: 4              43   str             4.44
Unnamed: 5  Unnamed: 5              43   str             4.44
Unnamed: 6  Unnamed: 6              43   str             4.44
Unnamed: 7  Unnamed: 7              15   str            66.67
icb_mapping_sheet
                  Column  Non-Null Count Dtype  Null Percentage
Unnamed: 0    Unnamed: 0             112   str             0.88
Unnamed: 1    Unnamed: 1             111   str             1.77
Unnamed: 2    Unnamed: 2             111   str             1.77
Unnamed: 3    Unnamed: 3             111   str             1.77
Unnamed: 4    Unnamed: 4             111   str             1.77
Unnamed: 5    Unnamed: 5             111   str             1.77
Unnamed: 6    Unnamed: 6             111   str             1.77
Unnamed: 7    Unnamed: 7             111   str             1.77
Unnamed: 8    Unnamed: 8             111   str             1.77
Unnamed: 9    Unnamed: 9             111   str             1.77
Unnamed: 10  Unnamed: 10             111   str             1.77
geography_sheet
                    Column  Non-Null Count    Dtype  Null Percentage
Unnamed: 0      Unnamed: 0               8   object            77.78
Unnamed: 1      Unnamed: 1              28   object            22.22
Unnamed: 2      Unnamed: 2               1  float64            97.22
Unnamed: 3      Unnamed: 3              30   object            16.67
Unnamed: 4      Unnamed: 4              29   object            19.44
...                    ...             ...      ...              ...
Unnamed: 115  Unnamed: 115              29   object            19.44
Unnamed: 116  Unnamed: 116              29   object            19.44
Unnamed: 117  Unnamed: 117              29   object            19.44
Unnamed: 118  Unnamed: 118              29   object            19.44
Unnamed: 119  Unnamed: 119              29   object            19.44

[120 rows x 4 columns]

/workspaces/cluster-project/.venv/lib/python3.12/site-packages/openpyxl/worksheet/_reader.py:329: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

Just like the REF table, these tables will unreadable because the data is in a format to be presentable to visually inspect. I will have to manually inspect the sheets and see if I can extract any more meaning or usefulness.

#### Quick Helper function
Just to make what I created above, I will create a small helper function, so I can view multiple sheet's summaries at once or multiple at the same time.

In [38]:
def get_summary(sheet_keys):
    if isinstance(sheet_keys, str):
        target_keys = [sheet_keys]
    else:
        target_keys = sheet_keys

    results = []

    for key in target_keys:
        table = other_sheets[key]
        
        summary = pd.DataFrame({
            'Column': table.columns,
            'Non-Null Count': table.notna().sum().values,
            'Dtype': table.dtypes.values,
            'Null %': (table.isna().mean() * 100).round(2)
        })
        results.append(summary)
    return results[0] if len(results) == 1 else results

In [42]:
get_summary("icb_mapping_sheet")

                  Column  Non-Null Count Dtype  Null %
Unnamed: 0    Unnamed: 0             112   str    0.88
Unnamed: 1    Unnamed: 1             111   str    1.77
Unnamed: 2    Unnamed: 2             111   str    1.77
Unnamed: 3    Unnamed: 3             111   str    1.77
Unnamed: 4    Unnamed: 4             111   str    1.77
Unnamed: 5    Unnamed: 5             111   str    1.77
Unnamed: 6    Unnamed: 6             111   str    1.77
Unnamed: 7    Unnamed: 7             111   str    1.77
Unnamed: 8    Unnamed: 8             111   str    1.77
Unnamed: 9    Unnamed: 9             111   str    1.77
Unnamed: 10  Unnamed: 10             111   str    1.77